<a href="https://colab.research.google.com/github/th2ry95/Data-Science-Portfolio/blob/main/Analyse_de_l'Attrition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
#Import des bibliotèques
import pandas as pd
import numpy as np
import random

#Structure de notre base de donnée
n_employees = 500
departments = ['Ventes', 'R&D', 'RH', 'Marketing', 'Logistique']
education = ['Bac', 'Master', 'Doctorat']

data = {
    'Employee_ID': np.arange(1, n_employees + 1),
    'Age': [random.randint(22, 60) for _ in range(n_employees)],
    'Department': [random.choice(departments) for _ in range(n_employees)],
    'Education': [random.choice(education) for _ in range(n_employees)],
    'Monthly_Income': [random.randint(2500, 8000) for _ in range(n_employees)],
    'Left_Company': [random.choice(['Yes', 'No']) for _ in range(n_employees)], # S'ils ont quitté la boîte
    'Years_at_Company': [random.randint(1, 15) for _ in range(n_employees)]
}

#Chargement de la base de donnée
df_hr = pd.DataFrame(data)
df_hr.to_csv('hr_data.csv', index=False)
print("Fichier 'hr_data.csv' prêt !")

Fichier 'hr_data.csv' prêt !

In [10]:
#import de notre fichier csv
df = pd.read_csv('hr_data.csv')

#Visiualisation des 5 premieres lignes
df.head()

,Employee_ID,Age,Department,Education,Monthly_Income,Left_Company,Years_at_Company
0,1,34,Marketing,Doctorat,4245,Yes,9
1,2,56,Ventes,Doctorat,5266,Yes,3
2,3,50,Ventes,Master,3122,No,10
3,4,47,R&D,Bac,3116,Yes,9
4,5,49,RH,Master,6884,Yes,2

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee_ID       500 non-null    int64
 1   Age               500 non-null    int64
 2   Department        500 non-null    object
 3   Education         500 non-null    object
 4   Monthly_Income    500 non-null    int64
 5   Left_Company      500 non-null    object
 6   Years_at_Company  500 non-null    int64
dtypes: int64(4), object(3)
memory usage: 27.5+ KB

In [12]:
df.isnull()

,Employee_ID,Age,Department,Education,Monthly_Income,Left_Company,Years_at_Company
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
495,False,False,False,False,False,False,False
496,False,False,False,False,False,False,False
497,False,False,False,False,False,False,False
498,False,False,False,False,False,False,False
499,False,False,False,False,False,False,False

#Quel est le salaire moyen par Département ?

In [13]:
Salaire_Moy = df.groupby('Department')['Monthly_Income'].mean()
Salaire_Moy

Department
Logistique    5186.871560
Marketing     5310.830508
R&D           4609.211268
RH            5334.386139
Ventes        5013.792079
Name: Monthly_Income, dtype: float64

In [14]:
Salaire_Moy.sort_values(ascending=False)

Department
RH            5334.386139
Marketing     5310.830508
Logistique    5186.871560
Ventes        5013.792079
R&D           4609.211268
Name: Monthly_Income, dtype: float64

#Le nombre de personnes ayant quitté l'entreprise pour chaque niveau d' Education.

In [15]:
df.loc[df['Left_Company'] == 'Yes'].groupby('Education')['Employee_ID'].count()

Education
Bac         76
Doctorat    87
Master      90
Name: Employee_ID, dtype: int64

In [16]:
# 3. Le Taux de Churn en %
departs = df.loc[df['Left_Company'] == 'Yes'].groupby('Education')['Employee_ID'].count()
total = df.groupby('Education')['Employee_ID'].count()
taux_churn = (departs / total) * 100

taux_churn.sort_values(ascending=False)

Education
Bac         55.072464
Master      52.325581
Doctorat    45.789474
Name: Employee_ID, dtype: float64